{"franchises": [
    {
        "id": "sw",
        "title": "Star Wars",
        "backdrop": "../src/assets/sw-bg-img.jpg",
        "movies" : [
            {"title" : "Star Wars: A New Hope", "poster" : "efe", "description" : "In the midst of a civil war, the Rebel Alliance steals plans for the Empire's planet-destroying space station, the Death Star. Princess Leia hides the plans in the memory of R2-D2, who escapes with C-3PO to the desert planet Tatooine. There, they are purchased by Luke Skywalker and his uncle and aunt, who are killed by stormtroopers searching for the droids. Luke teams up with Obi-Wan Kenobi, a former Jedi, and Han Solo, a smuggler, to rescue Leia and deliver the plans to the Rebels. They flee the planet on the Millennium Falcon and head to Alderaan, but discover it has been destroyed by the Death Star. The Falcon is captured, but they escape and Obi-Wan is killed in a duel with Darth Vader. The Rebels discover a weakness in the Death Star's defenses, and Luke leads an attack to destroy it with the help of Han and Chewbacca. They succeed, and Luke and Han are awarded medals for their heroism in a ceremony."},
            {"title" : "Star Wars: Empire Strikes Back", "poster" : "efe", "description" : "The Imperial fleet dispatches Probe Droids to find the Rebel Alliance. Luke Skywalker is captured by a wampa but escapes and is instructed by the spirit of Obi-Wan Kenobi to train on Dagobah with Jedi Master Yoda. Meanwhile, the Empire attacks the Rebel base on Hoth, forcing the Rebels to evacuate. Han, Leia, Chewbacca, and C-3PO escape aboard the Millennium Falcon, which malfunctions, and they hide in an asteroid field. They then travel to the floating Cloud City on Bespin, where Vader forces Lando to surrender the group to the Empire. Luke has a premonition of Han and Leia in pain and leaves his training to rescue them, only to engage in a lightsaber duel with Vader, who reveals that he is Luke's father. Luke drops into an air shaft but is rescued by the Falcon. The film ends with Luke, Leia, C-3PO, and R2-D2 observing as Lando and Chewbacca depart on the Falcon to find Han."},
            {"title" : "Star Wars: Return of Jedi", "poster" : "efe", "description" : "A year after Han Solo's capture, Luke Skywalker sends C-3PO and R2-D2 to crime lord Jabba the Hutt's palace to rescue Han, who is still frozen in carbonite. After Luke arrives to bargain for his friends' release, they are sentenced to death by being fed to the sarlacc. Luke frees his friends, and they battle Jabba's men. As the group rendezvous with the Rebel Alliance, Luke returns to Dagobah to complete his Jedi training with Yoda, who confirms that Darth Vader is Luke's father and reveals that there is another Skywalker. Obi-Wan Kenobi's Force spirit then tells Luke that Leia is his twin sister, and that he must face Vader again to finish his training and defeat the Empire. The Alliance learns that the Empire has been constructing a second Death Star under the supervision of the Emperor. Han leads a strike team to destroy the shield generator on the forest moon of Endor, which will allow the Rebel fleet to destroy the Death Star. Meanwhile, Luke confronts Vader and the Emperor, who reveals that the Death Star is fully operational and orders the firing of its superlaser. Luke defeats Vader, and Vader betrays the Emperor by throwing him down a reactor shaft to his death, but he is mortally electrocuted in the process. The Rebel fleet destroys the Imperial command ship, and Lando and Wedge destroy the Death Star's main reactor. After Luke burns Vader's armor on a pyre, he reunites with his friends, and they celebrate their victory."},
            {"title" : "Star Wars: The Force Awakens", "poster" : "efe", "description" : "Thirty years after the Galactic Empire's fall, the First Order has emerged and seeks to destroy the New Republic. The Resistance, led by General Leia Organa, opposes the First Order and searches for Leia's missing brother, Luke Skywalker. On Jakku, Poe Dameron receives a map to Luke's location but is captured by Kylo Ren. Poe's droid BB-8 escapes and meets scavenger Rey and a disillusioned stormtrooper named Finn. They steal the Millennium Falcon and meet Han Solo and Chewbacca. They learn Luke tried to rebuild the Jedi Order but went into exile after a student turned to the dark side. Starkiller Base destroys the New Republic and attacks Takodana. The Resistance fights back, and Kylo captures Rey but is defeated by her in a lightsaber duel. The Resistance destroys Starkiller Base and learns the rest of the map to Luke's location, which Rey finds on Ahch-To and presents him with his lightsaber."}]},
    {
        "id":"lotr",
        "title": "Lord of The Rings",
        "backdrop": "../src/assets/lotr-bg-img.jpg",
        "movies" : [
            {"title" : "The Lord of the Rings: The Fellowship of the Ring", "poster" : "efe", "description" : "\"The Lord of the Rings: The Fellowship of the Ring\" is a fantasy adventure film directed by Peter Jackson and based on the first volume of J.R.R. Tolkien's The Lord of the Rings trilogy. The film follows Frodo Baggins, a hobbit from the Shire, who inherits a powerful ring from his uncle, Bilbo. Frodo learns from the wizard Gandalf that the ring is the One Ring, created by the evil Sauron to control Middle-earth. Frodo and his hobbit friends, Sam, Merry, and Pippin, set out to destroy the ring by taking it to the fires of Mount Doom, where it was forged. They are joined by a fellowship of other characters, including Legolas the elf, Gimli the dwarf, and Aragorn, a human. Their journey is fraught with danger as they face attacks from orcs, dark riders, and other enemies of Sauron. They are also pursued by Gollum, a creature corrupted by the ring, who wants it for himself. The fellowship's quest takes them through various locations, including the mines of Moria and the elven realm of Lothlórien. Along the way, they must confront their own weaknesses and temptations, as the ring's power takes hold of them. The film ends with the fellowship breaking apart, as Frodo and Sam continue their journey alone towards Mount Doom, while the others fight battles to distract Sauron's forces."},
            {"title" : "The Lord of the Rings: The Two Towers", "poster" : "efe", "description" : "\"The Lord of the Rings: The Two Towers\" is the second installment in the epic fantasy film trilogy directed by Peter Jackson, based on J.R.R. Tolkien's novel of the same name. The movie picks up where the first film left off, with Frodo and Sam continuing their journey to destroy the One Ring while being pursued by Gollum. Meanwhile, Aragorn, Legolas, and Gimli are tracking down Merry and Pippin, who have been kidnapped by orcs. As the story progresses, Frodo, Sam, and Gollum become separated, and Gollum reveals his true nature as a former Ring-bearer driven by his obsession with the Ring. Aragorn, Legolas, and Gimli encounter the Rohirrim, a people who are being threatened by the forces of Saruman and Sauron. Together, they prepare for the impending battle against the armies of Mordor. The film's climactic battle takes place at Helm's Deep, where the Rohirrim and our heroes face overwhelming odds against the orcs. Meanwhile, Frodo and Sam continue their journey towards Mount Doom, but the Ring's corrupting influence takes a toll on Frodo's psyche. In the end, the forces of good prevail at Helm's Deep, but the fate of Frodo and Sam remains uncertain. The movie sets the stage for the final installment, \"The Lord of the Rings: The Return of the King.\""},
            {"title" : "The Lord of the Rings: Return of the King", "poster" : "efe", "description" : "\"The Lord of the Rings: The Return of the King\" is the third and final installment of the Lord of the Rings film trilogy directed by Peter Jackson. The movie follows the journey of hobbit Frodo Baggins and his loyal friend Samwise Gamgee as they make their way to Mount Doom to destroy the One Ring and end the reign of evil Lord Sauron. Meanwhile, the remaining members of the Fellowship of the Ring prepare for a final battle against Sauron's army. Aragorn, the rightful heir to the throne of Gondor, must unite the people of Middle-earth to fight against the dark forces and claim his rightful place as king. The film is filled with epic battles, stunning visual effects, and emotional moments as the characters confront their fears and make their final sacrifices. Along the way, they are aided by a host of allies, including the wise wizard Gandalf, the fierce warrior Eowyn, and the loyal dwarf Gimli. Ultimately, Frodo and Sam reach Mount Doom, but the journey takes a heavy toll on Frodo. Gollum, the creature obsessed with the ring, interferes with their mission, and Frodo must decide whether to destroy the ring or keep it for himself. In the end, the fate of Middle-earth hangs in the balance as the final battle rages on, and the heroes must confront their greatest challenges yet to achieve their ultimate goal of bringing peace and freedom to their world."}]},
    {
        "id" : "poa",
        "title": "Planet of the Apes",
        "backdrop": "../src/assets/poa-bg-img.jpg",
        "movies" : [
            {"title" : "Rise of the Planet of the Apes", "poster" : "efe", "description" : "At the story's heart is Caesar, a chimpanzee who gains human-like intelligence and emotions from an experimental drug. Raised like a child by the drug's creator, Will Rodman and a primatologist Caroline Aranha, Caesar ultimately finds himself taken from the humans he loves and imprisoned in an ape sanctuary in San Bruno. Seeking justice for his fellow inmates, Caesar gives the fellow apes the same drug that he inherited. He then assembles a simian army and escapes the sanctuary - putting man and ape on a collision course that could change the planet forever."},
            {"title" : "Dawn of the Planet of the Apes", "poster" : "efe", "description" : "A growing nation of genetically evolved apes led by Caesar is threatened by a band of human survivors of the devastating virus unleashed a decade earlier. They reach a fragile peace, but it proves short-lived, as both sides are brought to the brink of a war that will determine who will emerge as Earth's dominant species."},
            {"title" : "War of the Planet of the Apes", "poster" : "efe", "description" : "Caesar and his apes are forced into a deadly conflict with an army of humans led by a ruthless Colonel. After the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind. As the journey finally brings them face to face, Caesar and the Colonel are pitted against each other in an epic battle that will determine the fate of both their species and the future of the planet."}]},
    {
        "id": "gf",
        "title": "The Godfather",
        "backdrop": "../src/assets/gf-bg-img.jpg",
        "movies" : [
            {"title" : "The Godfather", "poster" : "efe", "description" : "Widely regarded as one of the greatest films of all time, this mob drama, based on Mario Puzo's novel of the same name, focuses on the powerful Italian-American crime family of Don Vito Corleone (Marlon Brando). When the don's youngest son, Michael (Al Pacino), reluctantly joins the Mafia, he becomes involved in the inevitable cycle of violence and betrayal. Although Michael tries to maintain a normal relationship with his wife, Kay (Diane Keaton), he is drawn deeper into the family business."},
            {"title" : "The Godfather Part II", "poster" : "efe", "description" : "The compelling sequel to \"The Godfather,\" contrasting the life of Corleone father and son. Traces the problems of Michael Corleone (Al Pacino) in 1958 and that of a young immigrant Vito Corleone (Robert De Niro) in 1917's Hell's Kitchen. Michael survives many misfortunes and Vito is introduced to a life of crime."},
            {"title" : "The Godfather Part III", "poster" : "efe", "description" : "As Michael Corleone (Al Pacino) ages, he finds that being the head of the Corleone crime family isn't getting any easier. He wants his family out of the Mafia, but the mob kingpin (Eli Wallach) isn't eager to let one of the most powerful and wealthy families go legit. Making matters even worse is Michael's nephew, Vincent (Andy Garcia). Not only does Vincent want a piece of the Corleone family's criminal empire, but he also wants Michael's daughter, Mary (Sofia Coppola)."}]}
        ]
    }

